app/Models/AuditTrailModel.php

    public function m_save_logs($data){
        $builder = $this->db->table('audittrails');
        $builder->insert($data);
---
INSERT INTO `audittrails` (`action`, `userid`) VALUES ('[Logged in] : User:collect1 date and time :Jun-19-2024 09:14:06', '51')