app/Models/UserManagementModel.php

SELECT `u`.`id`, `u`.`lastname`, `u`.`firstname`, `u`.`middlename`, `u`.`password`, `u`.`username`, `dept`.`name` as `department`
FROM `users` as `u`
LEFT JOIN `departments` as `dept` ON `dept`.`id` = `u`.`department_id`
WHERE `u`.`username` = 'collect1'
---
    public function findByUsername($username)
    {
       // Assuming you are using CodeIgniter's query builder
        $query = $this->db->table('users as u')
        ->select('u.id, u.lastname, u.firstname, u.middlename, u.password, u.username, dept.name as department')
        ->join('departments as dept', 'dept.id = u.department_id', 'left')
        ->where('u.username', $username)  // Assuming $username is a variable holding the username to filter by
        ->get();